DataProcessors/ЗаполнениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗаполнениеГрафика/Ext/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	//Для к = 0 По Набор.Количество()-1 Цикл
	//	
	//	Запись = Набор[к];
	//	Если Запись.Дата < ДатаНачала Тогда
	//	    Продолжить;
	//	ИначеЕсли Запись.Дата =Дат Тогда
	//		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//			Запись.Значение = 0;
	//		Иначе	          
	//			Запись.Значение = 8;
	//		КонецЕсли;
	//		Дат = Дат + ЧислоСекундВСутках;
	//	Иначе
	//		Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
	//			НоваяЗапись = Набор.Добавить();
	//			НоваяЗапись.Дата = Дат;
	//			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//				НоваяЗапись.Значение = 0;
	//			Иначе	          
	//				НоваяЗапись.Значение = 8;
	//			КонецЕсли; 
	//			Дат = Дат + ЧислоСекундВСутках;
	//		КонецЦикла; 
	//		Если Запись.Дата > ДатаОкончания Тогда
	//			Прервать;
	//		Иначе
	//			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//				Запись.Значение = 0;
	//			Иначе	          
	//				Запись.Значение = 8;
	//			КонецЕсли;
	//		КонецЕсли;
	//		Дат = Дат + ЧислоСекундВСутках;
	//	КонецЕсли; 
	//КонецЦикла;
	//Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Значение = 0;
			Запись.График = График;
		Иначе	          
			Запись.Значение = 1; 
			Запись.График = График;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
